In [1]:
import random as rdm
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("salario.csv")
df.head()

   id           pais       estado     cidade  genero        data   salario
0   1  United States      Alabama     Mobile    Male  10/01/1987  $5407.86
1   2       Portugal        Porto       Rego    Male  29/11/2007  $7833.82
2   3         Sweden       Kalmar   Emmaboda    Male  23/06/1984  $5530.85
3   4         Sweden  Västmanland       Sala  Female  04/11/1983  $2803.76
4   5         France     Bretagne  Quimperlé  Female  18/11/1990  $2201.87

## Unindo os atributos de localidade

In [3]:
ids = df.id
cities = df.cidade
states = df.estado
countries = df.pais

In [4]:
locality = []
for i in range(len(cities)):
    locality.append([ids[i], str('{}, {}, {}'.format(cities[i], states[i], countries[i]))])

In [5]:
df_locality = pd.DataFrame(locality, columns=['id', 'localidade'])
df_locality.head()

   id                      localidade
0   1  Mobile, Alabama, United States
1   2           Rego, Porto, Portugal
2   3        Emmaboda, Kalmar, Sweden
3   4       Sala, Västmanland, Sweden
4   5     Quimperlé, Bretagne, France

## Unindo os dataframes

In [6]:
join_dataset = pd.concat([df, df_locality], axis=1, join='inner')
join_dataset.head()

,id,pais,estado,cidade,genero,data,salario,id,localidade
0,1,United States,Alabama,Mobile,Male,10/01/1987,$5407.86,1,"Mobile, Alabama, United States"
1,2,Portugal,Porto,Rego,Male,29/11/2007,$7833.82,2,"Rego, Porto, Portugal"
2,3,Sweden,Kalmar,Emmaboda,Male,23/06/1984,$5530.85,3,"Emmaboda, Kalmar, Sweden"
3,4,Sweden,Västmanland,Sala,Female,04/11/1983,$2803.76,4,"Sala, Västmanland, Sweden"
4,5,France,Bretagne,Quimperlé,Female,18/11/1990,$2201.87,5,"Quimperlé, Bretagne, France"

## Removendo atributos

In [7]:
dataset = join_dataset.drop(columns = ['id', 'pais', 'estado', 'cidade', 'salario'])
dataset.head()

   genero        data                      localidade
0    Male  10/01/1987  Mobile, Alabama, United States
1    Male  29/11/2007           Rego, Porto, Portugal
2    Male  23/06/1984        Emmaboda, Kalmar, Sweden
3  Female  04/11/1983       Sala, Västmanland, Sweden
4  Female  18/11/1990     Quimperlé, Bretagne, France

In [24]:
equivalent_classes = []
for i in range(len(dataset)):
    register = [dataset.iloc[i]['genero'], dataset.iloc[i]['data'], dataset.iloc[i]['localidade']]
    if register not in equivalent_classes:
        equivalent_classes.append(register)

In [25]:
equivalent_classes = pd.DataFrame(equivalent_classes, columns=['genero', 'data_nasc', 'localidade'])
equivalent_classes.head()

   genero   data_nasc                      localidade
0    Male  10/01/1987  Mobile, Alabama, United States
1    Male  29/11/2007           Rego, Porto, Portugal
2    Male  23/06/1984        Emmaboda, Kalmar, Sweden
3  Female  04/11/1983       Sala, Västmanland, Sweden
4  Female  18/11/1990     Quimperlé, Bretagne, France

## Função de Precisão